; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph5 - mode
	thermograph1 - mode
	image0 - mode
	thermograph2 - mode
	image4 - mode
	image3 - mode
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 image3)
	(supports instrument0 image4)
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 image3)
	(have_image Star8 thermograph2)
	(have_image Star9 image3)
	(have_image Planet10 image3)
	(have_image Star11 thermograph5)
	(have_image Phenomenon12 image3)
	(have_image Planet13 image3)
	(have_image Planet14 thermograph2)
	(have_image Planet14 image0)
))

)

; plan
1. (turn_to satellite0 groundstation0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star11)
   goals met: 0 of 10
5. (take_image satellite0 star11 instrument0 thermograph5)
   added: (have_image star11 thermograph5)
   goals met: 1 of 10
6. (turn_to satellite0 planet13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet13)
   goals met: 1 of 10
7. (take_image satellite0 planet13 instrument0 image3)
   added: (have_image planet13 image3)
   goals met: 2 of 10
8. (turn_to satellite0 planet10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet10)
   goals met: 2 of 10
9. (take_image satellite0 planet10 instrument0 image3)
   added: (have_image planet10 image3)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon12 instrument0 image3)
   added: (have_image phenomenon12 image3)
   goals met: 5 of 10
14. (turn_to satellite0 planet14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet14)
   goals met: 5 of 10
15. (take_image satellite0 planet14 instrument0 image0)
   added: (have_image planet14 image0)
   goals met: 6 of 10
16. (take_image satellite0 planet14 instrument0 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 7 of 10
17. (turn_to satellite0 star8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star8)
   goals met: 7 of 10
18. (take_image satellite0 star8 instrument0 image3)
   added: (have_image star8 image3)
   goals met: 8 of 10
19. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 9 of 10
20. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 10
21. (take_image satellite0 star9 instrument0 image3)
   added: (have_image star9 image3)
   goals met: 10 of 10
